<a href="https://colab.research.google.com/github/Onkargaikwad/ds_r-code/blob/main/pandasonkar.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
df=pd.read_csv("/content/train.csv")

In [4]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [5]:
df.head(10)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

In [6]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [7]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [16]:
df.shape

(891, 12)

In [20]:
df.shape[0]

891

In [18]:
df.shape[1]

12

In [23]:
df.head(10),df.tail(10)

(   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
 0            1         0       3  ...   7.2500   NaN         S
 1            2         1       1  ...  71.2833   C85         C
 2            3         1       3  ...   7.9250   NaN         S
 3            4         1       1  ...  53.1000  C123         S
 4            5         0       3  ...   8.0500   NaN         S
 5            6         0       3  ...   8.4583   NaN         Q
 6            7         0       1  ...  51.8625   E46         S
 7            8         0       3  ...  21.0750   NaN         S
 8            9         1       3  ...  11.1333   NaN         S
 9           10         1       2  ...  30.0708   NaN         C

 [10 rows x 12 columns],
      PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
 881          882         0       3  ...   7.8958   NaN         S
 882          883         0       3  ...  10.5167   NaN         S
 883          884         0       2  ...  10.5000   NaN         S
 884          885         0       3  ...   7.0500   NaN         S
 885          886         0       3  ...  29.1250   NaN         Q
 886          887         0       2  ...  13.0000   NaN         S
 887          888         1       1  ...  30.0000   B42         S
 888          889         0       3  ...  23.4500   NaN         S
 889          890         1       1  ...  30.0000  C148         C
 890          891         0       3  ...   7.7500   NaN         Q

 [10 rows x 12 columns])

### Methods

In [ ]:
df.head(20)

In [35]:
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [36]:
df.max()

PassengerId                            891
Survived                                 1
Pclass                                   3
Name           van Melkebeke, Mr. Philemon
Sex                                   male
Age                                     80
SibSp                                    8
Parch                                    6
Ticket                           WE/P 5735
Fare                               512.329
dtype: object

In [37]:
df.sample(20)

     PassengerId  Survived  Pclass  ...      Fare Cabin  Embarked
681          682         1       1  ...   76.7292   D49         C
254          255         0       3  ...   20.2125   NaN         S
801          802         1       2  ...   26.2500   NaN         S
255          256         1       3  ...   15.2458   NaN         C
480          481         0       3  ...   46.9000   NaN         S
407          408         1       2  ...   18.7500   NaN         S
427          428         1       2  ...   26.0000   NaN         S
527          528         0       1  ...  221.7792   C95         S
9             10         1       2  ...   30.0708   NaN         C
543          544         1       2  ...   26.0000   NaN         S
584          585         0       3  ...    8.7125   NaN         C
708          709         1       1  ...  151.5500   NaN         S
601          602         0       3  ...    7.8958   NaN         S
858          859         1       3  ...   19.2583   NaN         C
19            20         1       3  ...    7.2250   NaN         C
45            46         0       3  ...    8.0500   NaN         S
248          249         1       1  ...   52.5542   D35         S
736          737         0       3  ...   34.3750   NaN         S
815          816         0       1  ...    0.0000  B102         S
323          324         1       2  ...   29.0000   NaN         S

[20 rows x 12 columns]

In [40]:
df._get_numeric_data()

     PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0              1         0       3  22.0      1      0   7.2500
1              2         1       1  38.0      1      0  71.2833
2              3         1       3  26.0      0      0   7.9250
3              4         1       1  35.0      1      0  53.1000
4              5         0       3  35.0      0      0   8.0500
..           ...       ...     ...   ...    ...    ...      ...
886          887         0       2  27.0      0      0  13.0000
887          888         1       1  19.0      0      0  30.0000
888          889         0       3   NaN      1      2  23.4500
889          890         1       1  26.0      0      0  30.0000
890          891         0       3  32.0      0      0   7.7500

[891 rows x 7 columns]

In [53]:
df.std()

PassengerId    257.353842
Survived         0.486592
Pclass           0.836071
Age             14.526497
SibSp            1.102743
Parch            0.806057
Fare            49.693429
dtype: float64

In [58]:
df_sub=df.head(50)

In [59]:
df_sub.mean()

PassengerId    25.500000
Survived        0.440000
Pclass          2.440000
Age            27.472222
SibSp           0.680000
Parch           0.400000
Fare           27.895416
dtype: float64

In [61]:
df.head(50).mean()

PassengerId    25.500000
Survived        0.440000
Pclass          2.440000
Age            27.472222
SibSp           0.680000
Parch           0.400000
Fare           27.895416
dtype: float64

In [14]:
import pandas as pd

In [15]:
df=pd.read_csv("/content/train.csv")

In [18]:
df.Name

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [19]:
df[["Name"]]

                                                  Name
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
..                                                 ...
886                              Montvila, Rev. Juozas
887                       Graham, Miss. Margaret Edith
888           Johnston, Miss. Catherine Helen "Carrie"
889                              Behr, Mr. Karl Howell
890                                Dooley, Mr. Patrick

[891 rows x 1 columns]

In [26]:
df[["Age"]].mean()

Age    29.699118
dtype: float64

In [27]:
df[["Fare"]].describe()

             Fare
count  891.000000
mean    32.204208
std     49.693429
min      0.000000
25%      7.910400
50%     14.454200
75%     31.000000
max    512.329200

In [30]:
df[["Age"]].count()

Age    714
dtype: int64

In [33]:
df_Fare=df.groupby(['Fare'])

In [34]:
df_Fare.mean()

          PassengerId  Survived    Pclass        Age  SibSp     Parch
Fare
0.0000         516.40  0.066667  1.933333  35.142857   0.00  0.000000
4.0125         379.00  0.000000  3.000000  20.000000   0.00  0.000000
5.0000         873.00  0.000000  1.000000  33.000000   0.00  0.000000
6.2375         327.00  0.000000  3.000000  61.000000   0.00  0.000000
6.4375         844.00  0.000000  3.000000  34.500000   0.00  0.000000
...               ...       ...       ...        ...    ...       ...
227.5250       589.25  0.750000  1.000000  32.666667   0.25  0.000000
247.5208       209.50  0.500000  1.000000  37.000000   0.00  1.000000
262.3750       527.50  1.000000  1.000000  19.500000   2.00  2.000000
263.0000       224.50  0.500000  1.000000  32.500000   2.50  2.500000
512.3292       559.00  1.000000  1.000000  35.333333   0.00  0.333333

[248 rows x 6 columns]